base/Catalogs/бит_ВидыВнутреннихДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>бит_ВидыВнутреннихДокументов</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НаборСвойств</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НаборыДополнительныхРеквизитовИСведений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Префикс</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>3</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПечатныеФормы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Идентификатор</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ВводНаОснованииПрименики</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Шаблон</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_ШаблоныВводаНаОсновании</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

base/Catalogs/бит_ВидыВнутреннихДокументов/Forms/ФормаЭлемента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Ключ.Пустая() Тогда
		ПодготовитьФормуНаСервере();
	КонецЕсли;
	
	// БСПный механизм использования общих наборов свойств работает "странно":
	//	При записи каждого элемента он переименовывает наименование общего набора на имя данного элемента.
	//	Кроме того, при пометке на удаление элемента, помечается на удаление весь набор, даже если он используется
	//	в других элементах (см. УправлениеСвойствами.ПередЗаписьюВидаОбъекта).
	// Во избежании подобной проблемы, запретим выбор общих наборов.
	Элементы.НаборСвойств.Видимость = Ложь;
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ПодготовитьФормуНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ТекущийОбъект.ПечатныеФормы.Очистить();
	Для каждого ПечатнаяФорма Из ПечатныеФормы Цикл
		Если ПечатнаяФорма.Пометка Тогда
			ПодключеннаяПечатнаяФорма = ТекущийОбъект.ПечатныеФормы.Добавить();
			ПодключеннаяПечатнаяФорма.Идентификатор = ПечатнаяФорма.Значение;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	ОбновитьПовторноИспользуемыеЗначения();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПодготовитьФормуНаСервере()
	
	ОбновитьПереченьПечатныхФорм();
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьПереченьПечатныхФорм()
	
	ПечатныеФормы.Очистить();
	
	КомандыПечатиВнутреннихДокументов = УправлениеПечатью.КомандыПечатиОбъекта(
											Метаданные.Справочники.бит_ВнутренниеДокументы);
	Для каждого КомандаПечати Из КомандыПечатиВнутреннихДокументов Цикл
		ИдентификаторПФ = КомандаПечати.Идентификатор;
		Отбор           = Новый Структура("Идентификатор", ИдентификаторПФ);
		Подключена      = (Объект.ПечатныеФормы.НайтиСтроки(Отбор).Количество() > 0);
		ПечатныеФормы.Добавить(ИдентификаторПФ, КомандаПечати.Представление, Подключена);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
